stress-test/test_ecs_ranking.yaml
config:
  target: "alb주소적기"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 300
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up (Ranking Only)"
    - duration: 120
      arrivalRate: 50
      name: "Sustained High Load"
  
  plugins:
    publish-metrics:
      - type: cloudwatch
        region: "ap-northeast-2"
        namespace: "Artillery/Stress-Tests"
        dimensions:
          - name: "Target"
            value: "ECS-Ranking-Only"

scenarios:
  - flow:
      - get:
          url: "/minigame/stress-cpu?duration=5000&load=0.8"