stress-test/test_ecs_ranking_scaling.yaml
config:
  target: "alb주소적기"
  phases:
    - duration: 180
      arrivalRate: 10
      name: "Warm up (Safe Load for 2 Tasks)"
    - duration: 300
      arrivalRate: 15
      rampTo: 80
      name: "Ramp up (Trigger Scaling)"
    - duration: 120
      arrivalRate: 80
      name: "Sustained High Load"
  
  plugins:
    publish-metrics:
      - type: cloudwatch
        region: "ap-northeast-2"
        namespace: "Artillery/Stress-Tests"
        dimensions:
          - name: "Target"
            value: "ECS-Ranking-Scaling"

scenarios:
  - flow:
      - get:
          url: "/minigame/stress-cpu?duration=5000&load=0.8"